[
    {
      "_id": "COE101",
      "name": "COE Undergraduate Advising",
      "number": "COE101",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "COE",
      "credits": 0,
      "description": "This canvas page is for the College of Engineering Undergraduate Advising. Please refer to this page for information on advising hours, contact information, and other resources.",
      "img": "COE101.jpg"
    },
    {
      "_id": "CS4530",
      "name": "Software Engineering",
      "number": "CS4530",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "CS",
      "credits": 4,
      "description": "This course covers the principles and practices of software engineering, focusing on the development of large-scale software systems. Topics include software requirements, design, implementation, testing, and maintenance. Emphasis is placed on software development methodologies, tools, and best practices. Students will work on a team project to apply the concepts learned in class to a real-world software development scenario.",
      "img": "CS4530.jpg"
    },
    {
      "_id": "EECE2322",
      "name": "Digital Design",
      "number": "EECE2322",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "EECE",
      "credits": 4,
      "description": "This course introduces students to the fundamentals of digital design and computer architecture. Topics include Boolean algebra, combinational and sequential logic, finite state machines, RISC-V, and memory systems. Students will learn to design and implement digital circuits using hardware description languages and simulation tools. The course also covers the principles of computer organization and the architecture of modern computing systems.",
      "img": "EECE2322.jpg"
    },
    {
      "_id": "EECE2323",
      "name": "Lab for Digital Design",
      "number": "EECE2323",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "EECE",
      "credits": 1,
      "description": "This lab course provides hands-on experience with digital design and computer architecture concepts covered in EECE 2322. Students will work on a series of projects to design, implement, and test digital circuits using hardware description languages and simulation tools. The lab exercises will reinforce the theoretical concepts learned in class and help students develop practical skills in digital design.",
      "img": "EECE2323.jpg"
    },
    {
      "_id": "EECE2520",
      "name": "Fundamentals of Networks",
      "number": "EECE2520",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "EECE",
      "credits": 4,
      "description": "This course provides an introduction to the fundamentals of computer networks. Topics include network architecture, protocols, layering, addressing, routing, and security. Students will learn the principles of network design, operation, and management, as well as the basics of network programming. The course also covers current trends and technologies in networking, such as wireless networks, the Internet of Things, and software-defined networking.",
      "img": "EECE2520.jpg"
    },
    {
      "_id": "EECE2540",
      "name": "Fundamentals of Linear Systems",
      "number": "EECE2540",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "EECE",
      "credits": 4,
      "description": "This course introduces students to the fundamentals of linear systems and signals. Topics include linear algebra, differential equations, Fourier analysis, Laplace transforms, and system modeling. Students will learn to analyze and design linear systems using mathematical tools and software simulations. The course also covers applications of linear systems in various engineering disciplines, such as control systems, communications, and signal processing.",
      "img": "EECE2540.jpg"
    },
    {
      "_id": "ENGW3315",
      "name": "Advanced Writing",
      "number": "ENGW3315",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "ENGW",
      "credits": 3,
      "description": "This course focuses on advanced writing skills for academic and professional contexts. Students will learn to write clear, concise, and persuasive essays, reports, and research papers. Topics include critical thinking, argumentation, research methods, and citation styles. The course also covers writing for specific audiences and purposes, such as technical writing, business communication, and academic publishing. Students will receive feedback on their writing and engage in peer review activities to improve their writing skills.",
      "author": "654f9ec2ea7ead465908d1e3",
      "img": "ENGW3315.jpg"
    }
  ]